<template>
    <ContentBody>
        <div class="about">
            <div>
                <h2>Привет!</h2>
                <h2 v-if="!isSmallScreen">
                    Меня зовут Даша, и все эти украшения делаю для вас я<br>Занимаюсь этим уже
                    15 лет, 10 из них
                    работаю с
                    серебром<br>Пять лет обучаю ювелирному делу и провожу мастер-классы
                </h2>
                <div v-else>
                    <h2>Меня зовут Даша, и все эти украшения делаю для вас я. Занимаюсь этим уже
                        15 лет, 10 из них
                        работаю с
                        серебром. Пять лет обучаю ювелирному делу и провожу мастер-классы</h2>
                </div>
                <img :src="imageUrl" >
                <br>
                <br>
                <h2>По любым вопросам можно
                    написать мне в телеграм <a href="https://t.me/Supremasilver">@Supremasilver</a>
                </h2>
                <br>
                <h2>
                    В моей в мастерской можно <a href="https://t.me/Supremasilver">арендовать</a> место для работы
                    (Краснодар)</h2>
            </div>
            <div>
                <h1>Покупка и доставка</h1>
                <h2 v-if="!isSmallScreen">Если вы купили готовое украшение -<br>оно отправляется на следующий день после
                    оплаты<br><br>
                    Украшение на заказ изготавливается две недели,<br>но точный срок всегда обговаривается
                    лично<br><br>На заказ я работаю по предоплате 50%
                    <br><br>Мастерская находится в Краснодаре,<br>отправляю куда угодно любыми службами доставки
                </h2>
                <div v-else>
                    <h2>
                        Если вы купили готовое украшение - оно отправляется на следующий день после оплаты
                    </h2>
                    <br>
                    <h2>
                        Украшение на заказ изготавливается две недели, но точный срок всегда обговаривается
                        лично
                    </h2>
                    <br>
                    <h2>
                        На заказ я работаю по предоплате 50%
                    </h2>
                    <br>
                    <h2>
                        Мастерская находится в Краснодаре, отправляю куда угодно любыми службами доставки
                    </h2>
                </div>
            </div>
            <div>
                <h1>Как узнать размер пальца?</h1>
                <h2>Лучше всего пойти в ювелирный магазин и измерить палец там</h2>
                <br>
                <h2>
                    Если у вас уже есть
                    кольцо, которое вам подходит, то измерьте его внутренний диаметр линейкой или штангенциркулем
                </h2>
                <br>
                <h2>
                    Народные методы с обматыванием
                    пальца ниткой ненадёжны
                </h2>
            </div>
        </div>
    </ContentBody>
</template>
  
<script setup>
import ContentBody from "@/components/ContentBody.vue"
import { onMounted, ref } from "vue";

const isSmallScreen = ref(false)
const imageUrl = new URL('/img/about/main.JPG', import.meta.url).href

onMounted(() => {
    if (window.innerWidth < 400) isSmallScreen.value = true
})
</script>
<style lang="scss" scoped>
h2 {
    color: #323232;
}

img {
    margin-top: 4px;
    margin-left: 4px;
    width: 100%;
}

.about {
    margin-right: 8px;
    gap: 48px;
    display: flex;
    flex-direction: column;
}

a {
    color: #0088cc;
}
</style>
  